{
  "python": "What programming language is known for its readability and ease of use?",
  "interpreter": "What component of Python executes code line by line?",
  "list": "What data structure is used to store ordered collections of items in Python?",
  "tuple": "What is a immutable, ordered collection of items in Python?",
  "dictionary": "What data structure is used to store key-value pairs in Python?",
  "indentation": "How is the block of code organized in Python instead of braces or keywords?",
  "function": "What is a reusable block of code that performs a specific task in Python?",
  "module": "What is a file containing Python code that can be reused in other Python files?",
  "pip": "What is the package installer for Python?",
  "virtualenv": "What is used to create isolated Python environments?",
  "class": "What is used to define a blueprint for creating objects in Python?",
  "inheritance": "What is the mechanism in Python by which one class can inherit the properties and methods of another class?",
  "polymorphism": "What is the ability of an object to take on multiple forms in Python?",
  "encapsulation": "What is the bundling of data and methods that operate on the data in Python?",
  "lambda": "What keyword is used to define anonymous functions in Python?",
  "map": "What function applies a given function to all the items in an input list in Python?",
  "filter": "What function constructs an iterator from elements of an iterable for which a function returns true in Python?",
  "reduce": "What function applies a rolling computation to sequential pairs of values in Python?",
  "tryexcept": "What is used for handling exceptions in Python?",
  "assert": "What keyword is used for debugging purposes by testing a condition in Python?",
  "decorator": "What is a design pattern in Python that allows behavior to be added to an object, either statically or dynamically?",
  "generator": "What is a special type of iterable, lazy object that yields one item at a time in Python?",
  "yield": "What keyword is used to produce a value from a generator in Python?",
  "threading": "What module is used for working with threads in Python?",
  "multiprocessing": "What module is used for working with processes in Python?",
  "json": "What module is used for encoding and decoding JSON in Python?",
  "regex": "What module is used for regular expressions in Python?",
  "pickle": "What module is used for serializing and deserializing Python objects?",
  "unittest": "What module is used for writing and running tests in Python?",
  "asyncio": "What module is used for writing asynchronous code in Python?",
  "flask": "What web framework is often used for building small to medium-sized web applications in Python?",
  "django": "What web framework is used for building larger web applications in Python?",
  "listcomprehension": "What is a concise way to create lists in Python?",
  "dictionarycomprehension": "What is a concise way to create dictionaries in Python?",
  "set": "What data structure is used to store an unordered collection of unique items in Python?",
  "fileio": "What module is used for reading and writing files in Python?",
  "os": "What module provides a way to interact with the operating system in Python?",
  "datetime": "What module is used for working with dates and times in Python?",
  "argparse": "What module is used for parsing command-line arguments in Python?",
  "asyncawait": "What keywords are used for writing asynchronous code in Python?",
  "pythonic": "What term is used to describe code that follows the conventions and idioms of the Python language?",
  "ducktyping": "What programming concept is often used in Python where the type or class of an object is less important than the methods it defines?",
  "pipenv": "What tool is used for dependency management in Python projects?",
  "fstring": "What is the concise way of formatting strings in Python introduced in Python 3.6?"
}