{
    "api": "What is the term for an interface that allows different software applications to communicate with each other?",
    "rest": "What architectural style uses HTTP requests to access and use web services?",
    "authentication": "What is the process of verifying the identity of a user or system?",
    "authorization": "What process determines whether a user or system has permission to access a resource?",
    "loadbalancer": "What is used to distribute incoming network traffic across multiple servers?",
    "caching": "What technique is used to store copies of frequently accessed data to improve performance?",
    "database": "What system is used to store, manage, and retrieve data in a structured format?",
    "sql": "What language is used for querying and managing relational databases?",
    "noSQL": "What type of database is designed for unstructured data and uses flexible schemas?",
    "endpoint": "What is a specific URL or URI that a client uses to interact with a web service?",
    "session": "What is a temporary data storage mechanism that maintains user state between requests?",
    "token": "What is a piece of data used for authentication or session management in web applications?",
    "ratelimit": "What is used to control the number of requests a client can make to a server in a given time period?",
    "middleware": "What is software that sits between the operating system and applications to provide services and functionalities?",
    "serialization": "What is the process of converting data into a format that can be easily transmitted or stored?",
    "deserialization": "What is the process of converting data from a transmitted format back into an application-specific format?",
    "httpmethods": "What are the standard methods used for interacting with resources in HTTP, such as GET, POST, PUT, and DELETE?",
    "queryoptimization": "What refers to the process of improving the performance of database queries?",
    "scalability": "What is the capability of a system to handle increasing amounts of load by adding resources?",
    "highavailability": "What refers to systems designed to ensure continuous operation and minimize downtime?",
    "microservices": "What architecture style structures an application as a collection of loosely coupled services?",
    "apiversioning": "What practice involves managing changes to APIs by providing different versions?",
    "logging": "What is the process of recording events or messages from a system for monitoring and debugging purposes?",
    "monitoring": "What refers to the ongoing process of tracking the performance and health of a system?",
    "distributed": "What refers to a network of independent systems that work together to achieve a common goal?",
    "eventdriven": "What architecture involves systems responding to events or changes in state?",
    "security": "What encompasses measures and protocols used to protect data and systems from unauthorized access or attacks?",
    "backup": "What is the process of creating copies of data to prevent loss in case of failure or disaster?",
    "failover": "What is a method used to ensure system continuity by automatically switching to a standby system in case of failure?",
    "apigateway": "What is a server that acts as an entry point for requests to a collection of microservices or APIs?",
    "servicediscovery": "What is the process by which services in a distributed system find and communicate with each other?"
  }
  